src/cf/AccumulationRegisters/РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РеквизитыПлатежногоПоручения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокУплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВключатьВДекларациюПоНалогуНаПрибыль</Name>
					<Comment>АПК:58 - различия имени и синонима вызваны обратной совместимостью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсчисленоПоДивидендам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогНаПрибыльДляДивидендов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаСКоторогоНеУдержанНалог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогСДивидендовУплаченныйЗаРубежом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышенияПоСтавке18</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышенияПоСтавке20</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышенияПоСтавке22</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаСПревышенияСКоторогоНеУдержанНалог</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаСПревышенияПоСтавке18СКоторогоНеУдержанНалог</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаСПревышенияПоСтавке20СКоторогоНеУдержанНалог</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаСПревышенияПоСтавке22СКоторогоНеУдержанНалог</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОснованияНДФЛ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУдержанияНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВДекларациюПоНалогуНаПрибыль</Name>
					<Comment>АПК:58 - различия имени и синонима вызваны обратной совместимостью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаченногоДохода</Name>
					<Comment>АПК:58 </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПеречисления</Name>
					<Comment>АПК:58 </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиПеречисляемогоНалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокУплаты</Name>
					<Comment>АПК:58 - различия имени и синонима вызваны обратной совместимостью</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВыплаченныйДоходВ6НДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДоходаФиксирована</Name>
					<Comment>АПК:58 </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстаревшаяДатаПолученияДохода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарегистрированоПриНачисленииАванса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Comment>АПК:58 имя сохранено ради обратной совместимости</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКодДохода</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДФЛРасчетыНалоговыхАгентовСБюджетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДФЛРасчетыНалоговыхАгентовСБюджетом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносамУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСФондамиПоСтраховымВзносамУНФ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Это может быть как головная организация, так и обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбязательногоСтрахованияСотрудников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбязательногоСтрахованияСотрудниковУНФ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСтраховыеВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоРасчетыПоНачислениюУплатеВзносовВФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/РегламентированнаяОтчетностьСотрудникиАрхивныеАлгоритмы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовИНалоговПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
	СтруктураРасчета = Новый Структура(
	"Организация,
	|СобытиеКалендаря,
	|ПериодОтчетности,
	|НДФЛСотрудники,
	|НДФЛСвышеПредельнойВеличины,
	|ПФРПоСуммарномуТарифу,
	|ПФРНакопительнаяСотрудники,
	|ПФРСтраховаяСотрудники,
	|ФСССотрудники,
	|ФССТравматизмСотрудники,
	|ФОМССотрудники,
	|ВидВзаиморасчетовСБюджетом,
	|СуммаВзаиморасчетовСБюджетом,
	|ДокументВзаиморасчетовСБюджетом,
	|СуммаНалога",
	Организация,
	СобытиеКалендаря,
	ПериодРасчета,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	Справочники.ВидыНалогов.ПустаяСсылка(),
	0,
	Неопределено,
	0);
	
	Запрос = Новый Запрос;
	Если ПериодРасчета > ДатаНачалаОбязательногоПримененияЕНП 
		И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		И ПериодРасчета < '20230701'Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход КАК НДФЛ,
		|	0 КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты
		|ГДЕ
		|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОбороты.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРДоПредельнойВеличиныОборот КАК ПФРПоСуммарномуТарифуОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФФОМСОборот КАК ФФОМСОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФССОборот КАК ФССОборот,
		|	ИсчисленныеСтраховыеВзносыОбороты.ФССНесчастныеСлучаиОборот КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК ИсчисленныеСтраховыеВзносыОбороты";
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ,
		|	НДФЛНалогОбороты.СуммаСПревышенияПриход КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ДатаОкончанияРасчетаНДФЛПоДатеНачисления, , Организация = &Организация) КАК НДФЛНалогОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Сумма КАК НДФЛ,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.СуммаСПревышения КАК НДФЛСПревышения
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Период МЕЖДУ &НачалоПериодаНДФЛ И &ОкончаниеПериодаНДФЛ
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Активность
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ДатаОкончанияРасчетаНДФЛПоДатеНачисления", ДатаНачалаОбязательногоПримененияЕНП - 1);  
	
	
	Если ПериодРасчета >= ДатаНачалаОбязательногоПримененияЕНП Тогда  
		
		Период = СобытиеКалендаря.ДатаОкончанияДокументов;
		ВводНачальныхДанных = Ложь;
		
		Если ВводНачальныхДанных Тогда
			ПериодЗаполнения = НачалоДня(Период) - 1;
		Иначе
			ПериодЗаполнения = Период;
		КонецЕсли;
		
		ДатаОтноситсяКТринадцатомуПериоду = НачалоДня(Период) >= Дата(Год(ПериодЗаполнения), 12, 23);
		ДатаОтноситсяКоВторойПоловинеМесяца = Ложь;
		Если Период >= '20240101' Тогда
			ДатаОтноситсяКоВторойПоловинеМесяца = НачалоДня(Период) >= Дата(Год(ПериодЗаполнения), Месяц(ПериодЗаполнения), 23);
		КонецЕсли;
		
		ВтораяПоловинаМесяца = ДатаОтноситсяКТринадцатомуПериоду Или ДатаОтноситсяКоВторойПоловинеМесяца;
		
		// Федеральный закон от 31.07.2023 № 389-ФЗ:
		// 12.2. В течение 2023 года налоговые агенты могут подавать уведомления об исчисленных суммах по налогу на доходы физических лиц, 
		// подлежащему перечислению в сроки, установленные пунктом 6 статьи 226, пунктом 9 статьи 226.1, пунктом 7 статьи 226.2 Налогового кодекса Российской Федерации, 
		// до истечения 12-го числа текущего месяца, указав в таком уведомлении сумму налога, 
		// удержанную в период с 23-го числа предыдущего месяца до 9-го числа текущего месяца.
		НачалоПериодаПодачиПромежуточныхУведомлений = НачалоДня(Дата(2023, 10, 1));
		КонецПериодаПодачиПромежуточныхУведомлений = КонецДня(Дата(2023, 12, 31));
		
		Если ВтораяПоловинаМесяца Тогда // 23 число - конец месяца
			ДатаНачалаОтбора    = Дата(Год(Период), Месяц(Период), 23);
			ДатаОкончанияОтбора = КонецМесяца(Период);
			ПоследнийПериод = КонецМесяца(Период) = КонецГода(Период);
		ИначеЕсли НачалоМесяца(Период) = НачалоГода(Период) Тогда // Январь
			ДатаНачалаОтбора    = НачалоГода(Период);
			ДатаОкончанияОтбора = Дата(Год(Период), Месяц(Период), 22);
		ИначеЕсли Период >= НачалоПериодаПодачиПромежуточныхУведомлений 
			И Период <= КонецПериодаПодачиПромежуточныхУведомлений 
			И День(Период) >= 9 И День(Период) < 23 Тогда
			ДатаНачалаОтбора    = Дата(Год(Период), Месяц(Период)-1, 23);
			ДатаОкончанияОтбора = Дата(Год(Период), Месяц(Период), 9);
		ИначеЕсли Период < '20240101' Тогда // остальные периоды 2023 г.
			ДатаНачалаОтбора    = Дата(Год(Период), Месяц(Период)-1, 23);
			ДатаОкончанияОтбора = Дата(Год(Период), Месяц(Период), 22);
		Иначе // остальные периоды 2024 г.
			ДатаНачалаОтбора    = Дата(Год(Период), Месяц(Период), 1);
			ДатаОкончанияОтбора = Дата(Год(Период), Месяц(Период), 22);
		КонецЕсли;  
	Иначе
		ДатаНачалаОтбора    = НачалоМесяца(ПериодРасчета);
		ДатаОкончанияОтбора = КонецМесяца(ПериодРасчета)
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("НачалоПериодаНДФЛ", ДатаНачалаОтбора);
	Запрос.УстановитьПараметр("ОкончаниеПериодаНДФЛ", ДатаОкончанияОтбора);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// НДфЛ
	СтруктураРасчета.НДФЛСотрудники = 0;
	СтруктураРасчета.НДФЛСвышеПредельнойВеличины = 0;
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураРасчета.НДФЛСотрудники = Выборка.НДФЛ;
		СтруктураРасчета.НДФЛСвышеПредельнойВеличины = Выборка.НДФЛСПревышения;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураРасчета.НДФЛСотрудники = СтруктураРасчета.НДФЛСотрудники + Выборка.НДФЛ;
		СтруктураРасчета.НДФЛСвышеПредельнойВеличины = СтруктураРасчета.НДФЛСвышеПредельнойВеличины + Выборка.НДФЛСПревышения;
	КонецЦикла;           
	
	Если ПериодРасчета < '20230701' Тогда
		
		Выборка = Пакет[2].Выбрать();
		Если Выборка.Следующий() Тогда
			Если Год(ПериодРасчета) > 2013 Тогда
				СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
			Иначе
				СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
			КонецЕсли;
			СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
			СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
			СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
			СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса()); 
		Если СистемаНалогообложения.ПрименяетсяАУСН И ПериодРасчета < '20230701' Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСреза", ПериодРасчета);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.СрезПоследних(&ДатаСреза, ) КАК РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				Размер = 0;
			Иначе
				Размер = Результат[0].Размер;
			КонецЕсли;
			
			МесячныйРазмерВзноса = Окр(Размер / 12, 2); 
			
			СтруктураРасчета.ФССТравматизмСотрудники = МесячныйРазмерВзноса;
			
			СтруктураРасчета.ПФРСтраховаяСотрудники = 0; СтруктураРасчета.ПФРСтраховаяСотрудники = 0;
			СтруктураРасчета.ФСССотрудники = 0; СтруктураРасчета.ФОМССотрудники = 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	СтруктураРасчета.СуммаНалога = СтруктураРасчета.НДФЛСотрудники+
	        СтруктураРасчета.НДФЛСвышеПредельнойВеличины+
			СтруктураРасчета.ПФРСтраховаяСотрудники+
			СтруктураРасчета.ПФРНакопительнаяСотрудники+
			СтруктураРасчета.ФСССотрудники+
			СтруктураРасчета.ФОМССотрудники+
			СтруктураРасчета.ФССТравматизмСотрудники;
	
		// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
			Организация,
			СобытиеКалендаря,
			Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
			"",
			СтруктураРасчета.СуммаНалога);
			
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета);
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции    


///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря, ТринадцатыйПериод = Ложь) Экспорт
	
	ДатаНачалаОбязательногоПримененияЕНП = РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП();
	
	СтруктураРасчета = Новый Структура(
	"Организация,
	|СобытиеКалендаря,
	|ПериодОтчетности,
	|ПФРПоСуммарномуТарифу,
	|ПФРНакопительнаяСотрудники,
	|ПФРСтраховаяСотрудники,
	|ФСССотрудники,
	|ФССТравматизмСотрудники,
	|ФОМССотрудники,
	|ВидВзаиморасчетовСБюджетом,
	|СуммаВзаиморасчетовСБюджетом,
	|ДокументВзаиморасчетовСБюджетом,
	|СуммаНалога",
	Организация,
	СобытиеКалендаря,
	ПериодРасчета,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	Справочники.ВидыНалогов.ПустаяСсылка(),
	0,
	Неопределено,
	0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРПоСуммарномуТарифу)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРНакопительная)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ПФРСтраховая)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФФОМС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФФОМСОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФСС)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССОборот,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудниковУНФ.ФССНесчастныеСлучаи)
		|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
		СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
		СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, ТекущаяДатаСеанса()); 
		Если СистемаНалогообложения.ПрименяетсяАУСН Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСреза", ПериодРасчета);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних.Размер КАК Размер
			|ИЗ
			|	РегистрСведений.РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСН.СрезПоследних(&ДатаСреза, ) КАК РазмерФиксированныхВзносовОтНесчастныхСлучаевАУСНСрезПоследних";
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				Размер = 0;
			Иначе
				Размер = Результат[0].Размер;
			КонецЕсли;
			
			МесяцРасчета = Месяц(ПериодРасчета);
			
			МесячныйРазмерВзноса = 0;
			ВзносыЗаПредыдущиеМесяцы = 0;
			
			Для Месяц = 1 По МесяцРасчета Цикл
				РазмерВзносаСНачалаГода = Окр(Размер * Месяц / 12, 2);
				МесячныйРазмерВзноса = РазмерВзносаСНачалаГода - ВзносыЗаПредыдущиеМесяцы;
				ВзносыЗаПредыдущиеМесяцы = ВзносыЗаПредыдущиеМесяцы + МесячныйРазмерВзноса;
			КонецЦикла;
					
			СтруктураРасчета.ФССТравматизмСотрудники = МесячныйРазмерВзноса;
			
			СтруктураРасчета.ПФРСтраховаяСотрудники = 0; СтруктураРасчета.ПФРСтраховаяСотрудники = 0;
			СтруктураРасчета.ФСССотрудники = 0; СтруктураРасчета.ФОМССотрудники = 0;	
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Если День(СобытиеКалендаря.ДатаОкончанияСобытия) > 20 Тогда
		СтруктураРасчета.СуммаНалога = СтруктураРасчета.ПФРСтраховаяСотрудники+
		СтруктураРасчета.ПФРНакопительнаяСотрудники+
		СтруктураРасчета.ФСССотрудники+
		СтруктураРасчета.ФОМССотрудники;
	Иначе
		 СтруктураРасчета.СуммаНалога =	СтруктураРасчета.ФССТравматизмСотрудники;
	КонецЕсли;
	
	// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Организация,
		СобытиеКалендаря,
		Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
		"",
		СтруктураРасчета.СуммаНалога);   	
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета); 
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции


#КонецОбласти
